In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.Series([0.25,0.5,0.75,1],["a","b","c","d"])
print("data ressemble à un tableau numpy\n",data)

data ressemble à un tableau numpy
 a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [3]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}

In [4]:
area_dict = {'California': 423967, 
             'Texas': 695662,
             'New York': 141297, 
             'Florida': 170312,
             'Illinois': 149995}

In [5]:
population = pd.Series(population_dict)
area = pd.Series(area_dict)
print(population)
# Que pensez vous de cette ligne?
print(population['California':'Florida'])

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
dtype: int64

In [6]:
pd.DataFrame(population,columns=["population"])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [7]:
[{"a":i,"b":2*i+6} for i in range(3)]

[{'a': 0, 'b': 6}, {'a': 1, 'b': 8}, {'a': 2, 'b': 10}]

In [8]:
pd.DataFrame([area_dict,population_dict],["area","population"]).T

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

In [9]:
pd.DataFrame({"population":population,"area":area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [10]:
def make_df(cols,ind):
    data={c:[str(c)+str(i) for i in ind]
          for c in cols}
    return pd.DataFrame(data,ind)

In [11]:
# exemple
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [12]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])

print(data)

# On peut désigner un élément d'une Series par son index
print(data.loc['b'])

# Ou bien par sa position
print(data.iloc[1])

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64
0.5
0.5

In [13]:
data = pd.DataFrame({'area':area, 'pop':population})
print(data)

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [14]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [15]:
data.loc[:,]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [16]:
data.iloc[4,0]

149995

In [17]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
df1

    A   B
1  A1  B1
2  A2  B2

In [18]:
df2

    A   B
3  A3  B3
4  A4  B4

In [19]:
pd.concat([df1,df2],axis=1)

     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

In [20]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])

In [21]:
type(y.index)

pandas.core.indexes.numeric.Int64Index

In [22]:
y.index = x.index  # Rend les index identiques

In [23]:
# Nous avons alors des index dupliqués
df=pd.concat([x,y])
print(df)

# Nous pouvons spécifier des index hiérarchiques
hdf = pd.concat([x, y], keys=['x', 'y'])
print(hdf)

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [24]:
df.loc[0,"A"]

0    A0
0    A2
Name: A, dtype: object

In [25]:
hdf.loc[("x",0),]

A    A0
B    B0
Name: (x, 0), dtype: object

In [26]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue','Bob'],
                    'department': ['Accounting', 'Engineering', 'Engineering', 'HR', 'Engineering']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'date': [2004, 2008, 2012, 2014]})
df1

  employee   department
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4      Bob  Engineering

In [27]:
df2

  employee  date
0     Lisa  2004
1      Bob  2008
2     Jake  2012
3      Sue  2014

In [28]:
pd.merge(df1,df2)

  employee   department  date
0      Bob   Accounting  2008
1      Bob  Engineering  2008
2     Jake  Engineering  2012
3     Lisa  Engineering  2004
4      Sue           HR  2014

In [29]:
pd.merge(df1,df2,left_on="employee",right_on="employee2")

KeyError: 'employee2'

In [30]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'department': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'date': [2004, 2008, 2012, 2014]})

df3 = pd.merge(df1, df2)
df3

  employee   department  date
0      Bob   Accounting  2008
1     Jake  Engineering  2012
2     Lisa  Engineering  2004
3      Sue           HR  2014

In [31]:
df4 = pd.DataFrame({'department': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
pd.merge(df3, df4)

  employee   department  date supervisor
0      Bob   Accounting  2008      Carly
1     Jake  Engineering  2012      Guido
2     Lisa  Engineering  2004      Guido
3      Sue           HR  2014      Steve

In [32]:
df5 = pd.DataFrame({'department': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'competence': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})

In [33]:
pd.merge(df1,df5)

  employee   department    competence
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [34]:
df6 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue', 'Lea'],
                    'department': ['Accounting', 'Engineering', 'Engineering', 'HR', 'Engineering']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'date': [2004, 2008, 2012, 2014]})

In [35]:
pd.merge(df6,df2,how="left")

  employee   department    date
0      Bob   Accounting  2008.0
1     Jake  Engineering  2012.0
2     Lisa  Engineering  2004.0
3      Sue           HR  2014.0
4      Lea  Engineering     NaN

In [36]:
pd.merge(df6,df2,how="outer")

  employee   department    date
0      Bob   Accounting  2008.0
1     Jake  Engineering  2012.0
2     Lisa  Engineering  2004.0
3      Sue           HR  2014.0
4      Lea  Engineering     NaN

In [38]:
# Nous ajoutons une nouvelle colonne à df1 et df2, qui contient toujours
# la même valeur, ici 0.
df1['key'] = 0
df2['key'] = 0

In [39]:
df1

  employee   department  key
0      Bob   Accounting    0
1     Jake  Engineering    0
2     Lisa  Engineering    0
3      Sue           HR    0

In [40]:
# La jointure plusieurs-à-plusieurs
produit_cartesien = pd.merge(df1, df2, on='key')

In [41]:
produit_cartesien

   employee_x   department  key employee_y  date
0         Bob   Accounting    0       Lisa  2004
1         Bob   Accounting    0        Bob  2008
2         Bob   Accounting    0       Jake  2012
3         Bob   Accounting    0        Sue  2014
4        Jake  Engineering    0       Lisa  2004
5        Jake  Engineering    0        Bob  2008
6        Jake  Engineering    0       Jake  2012
7        Jake  Engineering    0        Sue  2014
8        Lisa  Engineering    0       Lisa  2004
9        Lisa  Engineering    0        Bob  2008
10       Lisa  Engineering    0       Jake  2012
11       Lisa  Engineering    0        Sue  2014
12        Sue           HR    0       Lisa  2004
13        Sue           HR    0        Bob  2008
14        Sue           HR    0       Jake  2012
15        Sue           HR    0        Sue  2014

In [42]:
# Effaçons la colonne key qui n'est plus utile
produit_cartesien.drop('key',1, inplace=True)

In [43]:
produit_cartesien

   employee_x   department employee_y  date
0         Bob   Accounting       Lisa  2004
1         Bob   Accounting        Bob  2008
2         Bob   Accounting       Jake  2012
3         Bob   Accounting        Sue  2014
4        Jake  Engineering       Lisa  2004
5        Jake  Engineering        Bob  2008
6        Jake  Engineering       Jake  2012
7        Jake  Engineering        Sue  2014
8        Lisa  Engineering       Lisa  2004
9        Lisa  Engineering        Bob  2008
10       Lisa  Engineering       Jake  2012
11       Lisa  Engineering        Sue  2014
12        Sue           HR       Lisa  2004
13        Sue           HR        Bob  2008
14        Sue           HR       Jake  2012
15        Sue           HR        Sue  2014

In [45]:
rng = np.random.RandomState(42)
rng

In [46]:
# Une Series avec cinq nombres aléatoires
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [44]:
print(ser.sum())
print(ser.mean())

2.811925491708157
0.5623850983416314

In [50]:
df = pd.DataFrame({'A': rng.rand(5),
                   'B': rng.rand(5)})
df

          A         B
0  0.808397  0.122038
1  0.304614  0.495177
2  0.097672  0.034389
3  0.684233  0.909320
4  0.440152  0.258780

In [51]:
                
# Par colonne
print(df.mean())

# Par ligne
print(df.mean(axis='columns'))

A    0.467014
B    0.363941
dtype: float64
0    0.465218
1    0.399895
2    0.066030
3    0.796777
4    0.349466
dtype: float64

In [53]:
df=pd.DataFrame({"key":["A","B","C","A","B","C"],"data1":range(6),"data2":[10,11,10,9,10,10]})

df

  key  data1  data2
0   A      0     10
1   B      1     11
2   C      2     10
3   A      3      9
4   B      4     10
5   C      5     10

In [54]:
print(df)

  key  data1  data2
0   A      0     10
1   B      1     11
2   C      2     10
3   A      3      9
4   B      4     10
5   C      5     10

In [55]:
gb=df.groupby("key")
gb

In [57]:
print(gb.sum())

     data1  data2
key
A        3     19
B        5     21
C        7     20

In [58]:
print(gb.mean())

     data1  data2
key
A      1.5    9.5
B      2.5   10.5
C      3.5   10.0

In [60]:
pd.DataFrame?